load_test/reward_predictor_load_test_results/reward_predictor_load_test_results.txt

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: reward_predictor.js
     output: -

  scenarios: (100.00%) 1 scenario, 100 max VUs, 41m30s max duration (incl. graceful stop):
           * time_measurement_reward_predictor: Up to 13.33 iterations/s for 41m0s over 3 stages (maxVUs: 10-100, exec: reward_predictor, gracefulStop: 30s)


     ✓ status was ok

     checks.........................: 100.00% ✓ 28500     ✗ 0
     data_received..................: 7.4 MB  3.0 kB/s
     data_sent......................: 16 MB   6.6 kB/s
     errorRate......................: 0.00%   ✓ 0         ✗ 28500
     http_req_blocked...............: avg=9.87µs  min=0s     med=5µs    max=17.16ms  p(90)=10µs    p(95)=15µs
     http_req_connecting............: avg=75ns    min=0s     med=0s     max=670µs    p(90)=0s      p(95)=0s
   ✓ http_req_duration..............: avg=7.16ms  min=1.03ms med=3.38ms max=578.31ms p(90)=14.22ms p(95)=23.54ms
       { expected_response:true }...: avg=7.16ms  min=1.03ms med=3.38ms max=578.31ms p(90)=14.22ms p(95)=23.54ms
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 57000
     http_req_receiving.............: avg=79.98µs min=5µs    med=60µs   max=21.67ms  p(90)=104µs   p(95)=139µs
     http_req_sending...............: avg=40.19µs min=2µs    med=27µs   max=49.68ms  p(90)=47µs    p(95)=63µs
     http_req_tls_handshaking.......: avg=0s      min=0s     med=0s     max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=7.04ms  min=995µs  med=3.28ms max=578.28ms p(90)=14.01ms p(95)=23.32ms
     http_reqs......................: 57000   23.168711/s
     iteration_duration.............: avg=15.01ms min=2.55ms med=7.83ms max=683.27ms p(90)=30.16ms p(95)=47.65ms
     iterations.....................: 28500   11.584356/s
     vus............................: 0       min=0       max=7
     vus_max........................: 10      min=10      max=10


running (41m00.2s), 000/010 VUs, 28500 complete and 0 interrupted iterations
time_measurement_reward_pre... ✓ [======================================] 000/010 VUs  41m0s  00.33 iters/s